# Encoding
the encoding is technique to convert catagoriacal features to numeriacal values

there is two type of catagories in features

1.Nominal

In nominal the the feature values in columns are not ranked means there no relationship between individaul row you encoding them without the burded of ther order
ex:sex column,Price column

Encoding techiniques:
1)One hot Encoding
2)one hot encoding with many features(top-10)

2.Ordinal

In Ordinal the feture in column are  related to ech other an there are ranked. if understad the ranking the encoding these gives the expected results

# one hot encoding

In [1]:
import pandas as pd
df=pd.read_csv('titanic.csv')

In [2]:
df=df.select_dtypes(include='object').copy()

In [3]:
df['one_hot_encoding_sex']=pd.get_dummies(df['Sex'],drop_first=True)

In [4]:
df.head()

,Name,Sex,Ticket,Cabin,Embarked,one_hot_encoding_sex
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S,1
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C,0
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S,0
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S,0
4,"Allen, Mr. William Henry",male,373450,NaN,S,1

# One hot Encoding with to_many catogorical variable(TOP-10)

In [5]:
df['Embarked'].unique()

array(['S', 'C', 'Q', nan], dtype=object)

In [6]:
df['Embarked'].nunique()

3

In [7]:
df['Embarked'].value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

In [8]:
Top_10=df['Embarked'].value_counts().sort_values(ascending=False).head(1).index

In [9]:
Top_10

Index(['S'], dtype='object')

In [10]:
import numpy as np
for catagories in Top_10:
    df[catagories]=np.where(df['Embarked']==catagories,1,0)

In [11]:
df1=pd.read_csv('mercedes.csv',usecols=["X0","X1","X2","X3","X4","X5","X6"])

In [14]:
top_10=df1['X0'].value_counts().sort_values(ascending=True).head(10).index

In [15]:
top_10

Index(['ab', 'g', 'ac', 'q', 'aa', 'c', 'ao', 'bc', 'as', 'r'], dtype='object')

In [18]:
for cat in top_10:
    df1[cat]=np.where(df1['X0']==cat,1,0)

In [19]:
df1.head(10)

   X0 X1  X2 X3 X4 X5 X6  ab  g  ac  q  aa  c  ao  bc  as  r
0   k  v  at  a  d  u  j   0  0   0  0   0  0   0   0   0  0
1   k  t  av  e  d  y  l   0  0   0  0   0  0   0   0   0  0
2  az  w   n  c  d  x  j   0  0   0  0   0  0   0   0   0  0
3  az  t   n  f  d  x  l   0  0   0  0   0  0   0   0   0  0
4  az  v   n  f  d  h  d   0  0   0  0   0  0   0   0   0  0
5   t  b   e  c  d  g  h   0  0   0  0   0  0   0   0   0  0
6  al  r   e  f  d  f  h   0  0   0  0   0  0   0   0   0  0
7   o  l  as  f  d  f  j   0  0   0  0   0  0   0   0   0  0
8   w  s  as  e  d  f  i   0  0   0  0   0  0   0   0   0  0
9   j  b  aq  c  d  f  a   0  0   0  0   0  0   0   0   0  0


# Ordinal number Encoding
for ordinal catagories

In [20]:
import datetime
date_today=datetime.datetime.today()

In [21]:
date_today

datetime.datetime(2022, 5, 5, 13, 14, 13, 21055)

In [22]:
datetime.timedelta(3)

datetime.timedelta(days=3)

In [23]:
date_today-datetime.timedelta(1)

datetime.datetime(2022, 5, 4, 13, 14, 13, 21055)

In [24]:
days=[date_today-datetime.timedelta(x) for x in range(0,15)]

In [25]:
days

[datetime.datetime(2022, 5, 5, 13, 14, 13, 21055),
 datetime.datetime(2022, 5, 4, 13, 14, 13, 21055),
 datetime.datetime(2022, 5, 3, 13, 14, 13, 21055),
 datetime.datetime(2022, 5, 2, 13, 14, 13, 21055),
 datetime.datetime(2022, 5, 1, 13, 14, 13, 21055),
 datetime.datetime(2022, 4, 30, 13, 14, 13, 21055),
 datetime.datetime(2022, 4, 29, 13, 14, 13, 21055),
 datetime.datetime(2022, 4, 28, 13, 14, 13, 21055),
 datetime.datetime(2022, 4, 27, 13, 14, 13, 21055),
 datetime.datetime(2022, 4, 26, 13, 14, 13, 21055),
 datetime.datetime(2022, 4, 25, 13, 14, 13, 21055),
 datetime.datetime(2022, 4, 24, 13, 14, 13, 21055),
 datetime.datetime(2022, 4, 23, 13, 14, 13, 21055),
 datetime.datetime(2022, 4, 22, 13, 14, 13, 21055),
 datetime.datetime(2022, 4, 21, 13, 14, 13, 21055)]

In [26]:
import pandas as pd
df=pd.DataFrame(days,columns=['Days'])

In [27]:
df

                         Days
0  2022-05-05 13:14:13.021055
1  2022-05-04 13:14:13.021055
2  2022-05-03 13:14:13.021055
3  2022-05-02 13:14:13.021055
4  2022-05-01 13:14:13.021055
5  2022-04-30 13:14:13.021055
6  2022-04-29 13:14:13.021055
7  2022-04-28 13:14:13.021055
8  2022-04-27 13:14:13.021055
9  2022-04-26 13:14:13.021055
10 2022-04-25 13:14:13.021055
11 2022-04-24 13:14:13.021055
12 2022-04-23 13:14:13.021055
13 2022-04-22 13:14:13.021055
14 2022-04-21 13:14:13.021055

In [28]:
df['weekday']=df['Days'].dt.day_name()

In [29]:
df['weekday']

0      Thursday
1     Wednesday
2       Tuesday
3        Monday
4        Sunday
5      Saturday
6        Friday
7      Thursday
8     Wednesday
9       Tuesday
10       Monday
11       Sunday
12     Saturday
13       Friday
14     Thursday
Name: weekday, dtype: object

In [30]:
dict1={
    "Monday":1,"Tuesday":2,"Wednesday":3,"Thursday":4,"Saturday":5,"Friday":6,"Sunday":0
}

In [31]:
df['week_ordinal']=df['weekday'].map(dict1)

In [32]:
df.head()

                        Days    weekday  week_ordinal
0 2022-05-05 13:14:13.021055   Thursday             4
1 2022-05-04 13:14:13.021055  Wednesday             3
2 2022-05-03 13:14:13.021055    Tuesday             2
3 2022-05-02 13:14:13.021055     Monday             1
4 2022-05-01 13:14:13.021055     Sunday             0

# Count Or Frequency Encoding

In [70]:
df2=pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data",header=None)

In [71]:
df2.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [72]:
df2=df2.select_dtypes(include='object').copy()

In [73]:
df2

,1,3,5,6,7,8,9,13,14
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,<=50K
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,<=50K
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,<=50K
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States,<=50K
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States,>50K
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States,<=50K
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States,<=50K
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States,>50K

In [74]:
df2.columns=['Source_income','Qualification','status','jobs','personal_info','Race','Sex','country','Salary']

In [38]:
df

,Source_income,Qualification,status,jobs,personal_info,Race,Sex,country,Salary
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States,<=50K
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States,<=50K
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States,<=50K
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States,<=50K
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba,<=50K
...,...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States,<=50K
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States,>50K
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States,<=50K
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States,<=50K
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States,>50K

In [75]:
df2.nunique()

Source_income     9
Qualification    16
status            7
jobs             15
personal_info     6
Race              5
Sex               2
country          42
Salary            2
dtype: int64

In [76]:
country_map=df2['country'].value_counts().to_dict()

In [77]:
country_map

{' United-States': 29170,
 ' Mexico': 643,
 ' ?': 583,
 ' Philippines': 198,
 ' Germany': 137,
 ' Canada': 121,
 ' Puerto-Rico': 114,
 ' El-Salvador': 106,
 ' India': 100,
 ' Cuba': 95,
 ' England': 90,
 ' Jamaica': 81,
 ' South': 80,
 ' China': 75,
 ' Italy': 73,
 ' Dominican-Republic': 70,
 ' Vietnam': 67,
 ' Guatemala': 64,
 ' Japan': 62,
 ' Poland': 60,
 ' Columbia': 59,
 ' Taiwan': 51,
 ' Haiti': 44,
 ' Iran': 43,
 ' Portugal': 37,
 ' Nicaragua': 34,
 ' Peru': 31,
 ' France': 29,
 ' Greece': 29,
 ' Ecuador': 28,
 ' Ireland': 24,
 ' Hong': 20,
 ' Cambodia': 19,
 ' Trinadad&Tobago': 19,
 ' Laos': 18,
 ' Thailand': 18,
 ' Yugoslavia': 16,
 ' Outlying-US(Guam-USVI-etc)': 14,
 ' Honduras': 13,
 ' Hungary': 13,
 ' Scotland': 12,
 ' Holand-Netherlands': 1}

In [61]:
# for i in df.columns:
#     f=df[i].value_counts().to_dict()
#     df[i]=df[i].map(f)
    
    
# df.head()

In [78]:
df2['country']=df2['country'].map(country_map)

In [79]:
df2.head()

,Source_income,Qualification,status,jobs,personal_info,Race,Sex,country,Salary
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170,<=50K
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170,<=50K
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170,<=50K
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170,<=50K
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95,<=50K

# Target guided ordinal Encoding

In [2]:
import pandas as pd

In [3]:
df=pd.read_csv('titanic.csv',usecols=['Survived','Cabin'])

In [4]:
# random_state=df['Cabin'].dropna().sample(df['Cabin'].isnull().sum(),replace=True)
# random_state.index=df[df['Cabin'].isnull()].index
# df.loc[df['Cabin'].isnull(),df['Cabin']]=random_state

In [6]:
df['Cabin'].fillna("missing",inplace=True)

In [7]:
df['Cabin'].unique()

array(['missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [10]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [11]:
df.Cabin.unique

<bound method Series.unique of 0      m
1      C
2      m
3      C
4      m
      ..
886    m
887    B
888    m
889    C
890    m
Name: Cabin, Length: 891, dtype: object>

In [12]:
df.head()

   Survived Cabin
0         0     m
1         1     C
2         1     m
3         1     C
4         0     m

In [14]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
m    0.299854
Name: Survived, dtype: float64

In [15]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
m    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [16]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [25]:
original_label=df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [26]:
original_label

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [27]:
oridinal_label2={k:i for i,k in enumerate(original_label,0)}

In [28]:
oridinal_label2

{'T': 0, 'm': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [30]:
df['target_oridinal_label_cabin']=df['Cabin'].map(oridinal_label2)

In [31]:
df['target_oridinal_label_cabin']

0      1
1      4
2      1
3      4
4      1
      ..
886    1
887    6
888    1
889    4
890    1
Name: target_oridinal_label_cabin, Length: 891, dtype: int64

In [32]:
df.head()

   Survived Cabin  tarfet_oridinal_label_cabin  target_oridinal_label_cabin
0         0     m                            1                            1
1         1     C                            4                            4
2         1     m                            1                            1
3         1     C                            4                            4
4         0     m                            1                            1

# Mean Encoding

In [34]:
mean_ordinal=df.groupby(df['Cabin'])['Survived'].mean().to_dict()

In [35]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'T': 0.0,
 'm': 0.29985443959243085}

In [36]:
df['mean_cabin']=df['Cabin'].map(mean_ordinal)

In [37]:
df.head()

,Survived,Cabin,tarfet_oridinal_label_cabin,target_oridinal_label_cabin,mean_cabin
0,0,m,1,1,0.299854
1,1,C,4,4,0.593220
2,1,m,1,1,0.299854
3,1,C,4,4,0.593220
4,0,m,1,1,0.299854

# probabality encoding

In [47]:
import pandas as pd

In [78]:
df=pd.read_csv('titanic.csv')

In [79]:
# df=df.select_dtypes(include='object').copy()

In [80]:
df['Cabin'].fillna("Missing",inplace=True)

In [81]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,Missing,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,Missing,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,Missing,S

In [82]:
df['Survived'].mean()

0.3838383838383838

In [83]:
df1.head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,M,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,M,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C,S
4,"Allen, Mr. William Henry",male,373450,M,S

In [84]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [85]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,M,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,M,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,M,S

In [87]:
prob_df=df.groupby(['Cabin'])['Survived'].mean()

In [99]:
prob_df=pd.DataFrame(prob_df)
prob_df

       Survived
Cabin
A      0.466667
B      0.744681
C      0.593220
D      0.757576
E      0.750000
F      0.615385
G      0.500000
M      0.299854
T      0.000000

In [96]:
prob_df_died=1-prob_df['Survived']

In [100]:
prob_df['prob_df_died']=prob_df_died

In [102]:
prob_df.head()

       Survived  prob_df_died
Cabin
A      0.466667      0.533333
B      0.744681      0.255319
C      0.593220      0.406780
D      0.757576      0.242424
E      0.750000      0.250000

In [103]:
prob_df['probability_ratio']=prob_df['Survived']/prob_df['prob_df_died']

In [104]:
prob_df['probability_ratio']

Cabin
A    0.875000
B    2.916667
C    1.458333
D    3.125000
E    3.000000
F    1.600000
G    1.000000
M    0.428274
T    0.000000
Name: probability_ratio, dtype: float64

In [105]:
prob_df.head()

       Survived  prob_df_died  probability_ratio
Cabin
A      0.466667      0.533333           0.875000
B      0.744681      0.255319           2.916667
C      0.593220      0.406780           1.458333
D      0.757576      0.242424           3.125000
E      0.750000      0.250000           3.000000

In [ ]:
df['Cabin_probality']=df['Cabin'].map(df['probability_ratio'])